pjalocha/nrf52-ogn-tracker/src/main.cpp
static Button2 Button(Button_Pin);
#if defined(WITH_WIO_TRACKER) && defined(WITH_BEEPER)
static Button2 BuzzerSwitch(Trackball_PinPress);
#endif

static void Button_Single(Button2 Butt)
{
#ifdef WITH_EPAPER
  if(EPD_IsRadarView())
  { EPD_TrafficRange_Next();
    return; }
#endif
#ifdef WITH_OLED
  if(OLED_PageOFF)
    OLED_PageOFF=0;
  else
    OLED_NextPage();
  #ifdef WITH_OLED_DIM
    OLED_PageActive=millis();
  #endif
#endif
}

static void Button_Double(Button2 Butt)
{
#ifdef WITH_EPAPER
  EPD_BacklightOn(15000);
#endif
}

static void Button_Long(Button2 Butt)
{ PowerMode=0;
  /// specific stuff to do before shutdown
  delay(4000);
  NRF_POWER->SYSTEMOFF = 1;
  __DSB();
  __WFI();   // never returns
}

#if defined(WITH_WIO_TRACKER) && defined(WITH_BEEPER)
static void BuzzerSwitch_Long(Button2 Butt)
{ if(AlarmThresh==0)
  { // Descending confirmation before muting.
    Play(Play_Vol_1 | Play_Oct_1 | 4, 100);
    Play(Play_Vol_0 | Play_Oct_1 | 4,  50);
    Play(Play_Vol_1 | Play_Oct_1 | 3, 150);
    AlarmThresh=4; }
  else
  { // Ascending confirmation after enabling.
    Play(Play_Vol_1 | Play_Oct_1 | 3, 100);
    Play(Play_Vol_0 | Play_Oct_1 | 3,  50);
    Play(Play_Vol_1 | Play_Oct_1 | 4, 150);
    AlarmThresh=0; }
}
#endif

static void Button_Init(void)
{ pinMode(Button_Pin, INPUT);
  Button.setLongClickTime(3000);
  Button.setClickHandler(Button_Single);
  Button.setDoubleClickHandler(Button_Double);
  Button.setLongClickDetectedHandler(Button_Long);
#if defined(WITH_WIO_TRACKER) && defined(WITH_BEEPER)
  pinMode(Trackball_PinPress, INPUT_PULLUP);
  BuzzerSwitch.setLongClickTime(2000);
  BuzzerSwitch.setLongClickDetectedHandler(BuzzerSwitch_Long);
#endif
}



// =======================================================================================================

bool CONS_UART_isConnected(void) // { return 0; } // only for tests
{ return Serial && Serial.dtr(); }

int CONS_UART_Read(uint8_t &Byte)
{ if(!Serial.available()) return 0;
  Byte = (uint8_t)Serial.read(); return 1; }

void CONS_UART_Write(char Byte)
{ if(CONS_UART_Free()<80) return;
  Serial.write((uint8_t)Byte); }

int CONS_UART_Free(void)
{ return Serial.availableForWrite(); }

// =======================================================================================================

#ifdef GPS_PinPPS
uint32_t PPS_Intr_msTime = 0;   // [ms] xTaskGetTickCount() counter at the time of the PPS
uint32_t PPS_Intr_usTime = 0;   // [us] micros() counter at the time of the PPS

uint32_t PPS_usPrecTime  = 0;   // [1/16us] precise time of the PPS
uint32_t PPS_usTimeRMS   = 0;   // [1/4us]  precise PPS time residue time error RMS

uint32_t PPS_Intr_usFirst= 0;   // [us] micros() counter at the first interrupt in a series
uint32_t PPS_Intr_Count  = 0;   // [count] good PPS interrupts in the series
uint32_t PPS_Intr_Missed = 0;   // [count] missed PPS interrupts

 int32_t PPS_usPeriodErr = 0;   // [1/16us] PPS period average systematic error
uint32_t PPS_usPeriodRMS = 0;   // [(1/4us)^2] mean square of statistical error

const uint32_t PPS_usPeriod = 1000000;  // [usec] expected PPS period = 1sec = 10000000usec

static void PPS_Intr(void *Context)
{ uint32_t usTime = micros();                                     // [usec] usec-clock at interrupt time
  uint32_t msTime = xTaskGetTickCount();                          // [msec] mses-clock at interrupt time
  uint32_t usDelta = usTime - PPS_Intr_usTime;                    // difference from the previous PPS
  PPS_Intr_usTime = usTime;                                       // [usec]
  PPS_Intr_msTime = msTime;                                       // [ms]
  uint32_t Cycles = (usDelta+PPS_usPeriod/2)/PPS_usPeriod;        // how many PPS periods past
   int32_t usResid = usDelta-Cycles*PPS_usPeriod;                 // [usec]
  if(Cycles>0 && Cycles<=10 && abs(usResid)<Cycles*500)           // condition to accept the PPS edge
  { int32_t ResidErr = (usResid<<4)-PPS_usPeriodErr;              // [1/16us]
    if(Cycles>1) ResidErr/=Cycles;
    PPS_usPeriodErr += (ResidErr+2)>>2;                         // [1/16us] average the PPS period error
    uint32_t ErrSqr = ResidErr*ResidErr;
    if(PPS_Intr_Count)                                            // if not the first edge in the series
    { PPS_usPrecTime += ((PPS_usPeriod<<4)+PPS_usPeriodErr)*Cycles;  // [1/16us] forcast the PPS time to the current PPS
      PPS_usPeriodRMS += ((int32_t)((ErrSqr>>4)-PPS_usPeriodRMS)+2)>>2;
      int32_t usTimeErr = (usTime<<4)-PPS_usPrecTime;                // [1/16us] difference between current PPs and the forecast
      PPS_usPrecTime += (usTimeErr+2)>>2;                            // [1/16us]
      uint32_t ErrSqr = usTimeErr*usTimeErr;
      PPS_usTimeRMS += ((int32_t)((ErrSqr>>4)-PPS_usTimeRMS)+2)>>2; }
    else                                                          // if this was the very first edge in the series
    { PPS_usPrecTime  = PPS_Intr_usTime<<4;
      PPS_usTimeRMS   = 4<<4;
      PPS_usPeriodErr = ResidErr;
      PPS_usPeriodRMS = 4<<4; }                                   // set statistical error RMS to 2 usec
    PPS_Intr_Count += Cycles;
    PPS_Intr_Missed+= Cycles-1; }                                 // count PPS cycles
  else                                                            // if edge is not accepted
  { PPS_Intr_Count=0;                                             // then we start all from scratch
    PPS_Intr_Missed=0;
    PPS_Intr_usFirst= usTime; }
}

int PPS_Print(char *Line)
{ int Len=0;
  uint32_t msTime = millis();
  uint32_t PPSage = msTime-PPS_Intr_msTime;                         // [ms] time since the last PPS interrupt
  uint32_t UTC    = GPS_TimeSync.UTC;                               // [sec] time since last ref. UTC
  uint32_t UTCage = msTime-GPS_TimeSync.sysTime;                    // [ms] time since last ref. UTC
  // Serial.printf("PPS: PPSage:%u UTCage:%u [ms] UTC:%u", PPSage, UTCage, UTC);
  PPSage -= UTCage;                                                 //
  PPSage += 500;
  UTC -= PPSage/1000;
  // Serial.printf(" => PPSage:%u UTC:%u\n", PPSage, UTC);
  if(PPS_Intr_Count>=10 && PPSage<=20000)
    Len=sprintf(Line, "SatPPS: %08X:%08X/16MHz/%3.1fus %+3.1fppm %3.1fus %ds",
              UTC, PPS_usPrecTime,
              (1.0/4)*IntSqrt(PPS_usTimeRMS),
              (-1.0/16)*PPS_usPeriodErr, (1.0/4)*IntSqrt(PPS_usPeriodRMS),
              PPS_Intr_Count );
  return Len; }
#endif

void GPS_UART_Init(uint32_t BaudRate)
{ // gps_baud_rate = BaudRate;
  // Serial1.end();
  Serial1.setPins(GPS_PinRx, GPS_PinTx);
  Serial1.begin(BaudRate);
#if defined(GPS_PinEna)
  if(GPS_PinEna>=0)
  { pinMode(GPS_PinEna, OUTPUT);
    digitalWrite(GPS_PinEna, HIGH); }
#endif
#if defined(GPS_PinReset)
  if(GPS_PinReset>=0)
  { pinMode(GPS_PinReset, OUTPUT);
    digitalWrite(GPS_PinReset, HIGH); }
#endif
#if defined(GPS_PinPPS)
  if(GPS_PinPPS>=0)
  { pinMode(GPS_PinPPS, INPUT);
    // attachInterrupt(digitalPinToInterrupt(GPS_PinPPS), PPS_Intr, RISING);
  }
#endif
}

