pjalocha/nrf52-ogn-tracker/src/main.cpp
#ifdef GPS_PinEna
void GPS_DISABLE(void) { digitalWrite(GPS_PinEna, LOW); }
void GPS_ENABLE (void) { digitalWrite(GPS_PinEna, HIGH); }
#endif

int GPS_UART_Full(void)
{ return Serial1.available(); }

int GPS_UART_Read(uint8_t &Byte)
{ if (!Serial1.available()) return 0;
  Byte = (uint8_t)Serial1.read(); return 1; }

int GPS_UART_Read(uint8_t *Data, int Max)
{ int Count=0;
  while (Count<Max && Serial1.available())
  { Data[Count++] = (uint8_t)Serial1.read(); }
  return Count; }

void GPS_UART_Write(char Byte)
{ Serial1.write((uint8_t)Byte); }

void GPS_UART_Flush(int MaxWait)
{ uint32_t start = millis();
  Serial1.flush();
  while (Serial1.available() && ((int)(millis() - start) < MaxWait))
  { (void)Serial1.read(); }
}

void GPS_UART_SetBaudrate(int BaudRate)
{ // gps_baud_rate = BaudRate;
  Serial1.end();
  Serial1.setPins(GPS_PinRx, GPS_PinTx);
  Serial1.begin(BaudRate); }

bool GPS_PPS_isOn(void)
{
#if defined(GPS_PinPPS)
  if(GPS_PinPPS<0) return false;
  return digitalRead(GPS_PinPPS) != LOW;
#else
  return false;
#endif
}

// =======================================================================================================

void SysLog_Line(const char *Line, int LineLen, bool Timestamp, int msTimeout, bool LogOnly)
{ (void)Timestamp;
  if(!CONS_UART_isConnected()) return;
  if (LogOnly || Line==0 || LineLen <= 0) return;
#ifdef CONS_OUTPUT
  if(!xSemaphoreTake(CONS_Mutex, msTimeout)) return;
  if(CONS_UART_Free()>LineLen) Serial.write((const uint8_t *)Line, LineLen);
  xSemaphoreGive(CONS_Mutex);
#endif
}

void SysLog_Line(const char *Line, bool Timestamp, int msTimeout, bool LogOnly)
{ if (Line==0) return;
  SysLog_Line(Line, (int)strlen(Line), Timestamp, msTimeout, LogOnly); }

void SysLog_Line(const char *Line, int LineLen, bool Timestamp, int msTimeout)
{ SysLog_Line(Line, LineLen, Timestamp, msTimeout, false); }

void SysLog_Line(const char *Line, bool Timestamp, int msTimeout)
{ SysLog_Line(Line, Timestamp, msTimeout, false); }

// =======================================================================================================

static char Line[512];

void setup()
{
  pinMode(LED_PinRed, OUTPUT);
  digitalWrite(LED_PinRed  , LED_StateOn);
#ifdef LED_PinGreen
  pinMode(LED_PinGreen, OUTPUT);
  digitalWrite(LED_PinGreen, LED_StateOff);
#endif
#ifdef LED_PinBlue
  pinMode(LED_PinBlue, OUTPUT);
  digitalWrite(LED_PinBlue , LED_StateOff);
#endif

#ifdef IO_Power_Pin
  pinMode(IO_Power_Pin, OUTPUT);
  digitalWrite(IO_Power_Pin, HIGH);
#endif
#ifdef RF_Power_Pin
  pinMode(RF_Power_Pin, OUTPUT);
  digitalWrite(RF_Power_Pin, HIGH);
#endif

  ADC_Init();
#if defined(Battery_Enable_Pin)
  pinMode(Battery_Enable_Pin, OUTPUT);
  digitalWrite(Battery_Enable_Pin, HIGH);
#endif

  Button_Init();
  InternalFS.begin();
  HardwareStatus.SPIFFS = LogFS_begin();
  Parameters.setDefault(getUniqueAddress()); // set default parameter values
  if(Parameters.ReadFromNVS()<0)             // try to get parameters from NVS
  { Parameters.WriteToNVS(); }
  if(Parameters.BTname[0]==0)                // for the BT to work
  { Parameters.getAprsCall(Parameters.BTname);
    Parameters.WriteToNVS(); }

  CONS_Mutex = xSemaphoreCreateMutex();
  I2C_Mutex = xSemaphoreCreateMutex();
  // WIFI_Mutex = xSemaphoreCreateMutex();

  Wire.setPins(I2C_PinSDA, I2C_PinSCL);
  Wire.begin();
  Wire.setClock(400000);
  // I2C_Scan(Wire, "I2C bus:");
#ifdef WITH_OLED
  OLED.setI2CAddress(0x3D<<1);
  OLED.begin();
  // OLED.setDisplayRotation(OLED_Rotate ? U8G2_R2 : U8G2_R0);
  OLED.clearBuffer();
  OLED_DrawLogo(OLED.getU8g2(), 0);
  OLED.sendBuffer();
#endif

  Serial.begin(115200);
  Serial.println();
  // delay(1000);
  digitalWrite(LED_PinRed, LED_StateOff);

#ifdef WITH_BEEPER
  Beep_Init();
#ifdef WITH_BEEPER_GEN
  Play_Morse('S');
#else
#ifdef WITH_WIO_TRACKER
  // The Wio Tracker L1 buzzer is markedly louder around 2.5-2.65kHz.
  // Play(Play_Vol_1 | Play_Oct_2 | 0x03, 250); // 2489Hz
  // Play(Play_Vol_1 | Play_Oct_2 | 0x04, 250); // 2637Hz
  Play(Play_Vol_1 | Play_Oct_0 | 0x05, 250);
  Play(Play_Vol_1 | Play_Oct_0 | 0x08, 250);
#else
  Play(Play_Vol_1 | Play_Oct_0 | 0x05, 250);
  Play(Play_Vol_1 | Play_Oct_0 | 0x08, 250);
#endif
  Play(Play_Vol_0 | Play_Oct_0 | 0x00, 100);
#endif
  // Play_Morse(' ');
  // Play_Morse('O');
  // Play_Morse('G');
  // Play_Morse('N');
#endif

  Serial.print("nrf52-ogn-tracker ");
  Serial.print(HARD_NAME);
  Serial.println(" GPS/FreeRTOS check");
  // delay(1000);
  Serial.print("Build: ");
  Serial.print(__DATE__);
  Serial.print(' ');
  Serial.println(__TIME__);
  // delay(1000);
  // Serial.print("FreeRTOS tick [Hz] = ");
  // Serial.println(configTICK_RATE_HZ);

  LogFS_printStatus(Serial);
  LogFS_listRoot(Serial);

  GPS_UART_Init(GPS_getBaudRate());
#ifdef WITH_BLE_SPP
  BLE_Init();
#endif

  xTaskCreate(vTaskGPS    ,  "GPS"  ,  1000, NULL, 1, NULL);  // read data from GPS
  xTaskCreate(Radio_Task  ,  "RF"   ,  1200, NULL, 2, NULL);  // transmit/receive packets
  xTaskCreate(vTaskPROC   ,  "PROC" ,  1200, NULL, 1, NULL);  // process received packets, prepare packets for transmission
#ifdef WITH_LOG
  xTaskCreate(vTaskLOG    ,  "LOG"  ,  3000, NULL, 0, NULL);  // write received and own packets to external flash
#endif
#ifdef WITH_EPAPER
  xTaskCreate(EPD_Task    ,  "EPD"  ,  3000, NULL, 0, NULL);  // update e-paper display
#endif

}

// ===================================================================================================================

static NMEA_RxMsg NMEA;

static void PrintParameters(void)                              // print parameters stored in Flash
{ Parameters.Print(Line);
  if(!xSemaphoreTake(CONS_Mutex, 100)) return;                 // ask exclusivity on UART1
  Format_String(CONS_UART_Write, Line);
  xSemaphoreGive(CONS_Mutex); }                                // give back UART1 to other tasks

static void PrintPOGNS(void)                                   // print parameters in the $POGNS form
{ if(!xSemaphoreTake(CONS_Mutex, 100)) return;
  Parameters.WritePOGNS(Line);
  Format_String(CONS_UART_Write, Line);
  Parameters.WritePOGNS_Pilot(Line);
  Format_String(CONS_UART_Write, Line);
  Parameters.WritePOGNS_Acft(Line);
  Format_String(CONS_UART_Write, Line);
  Parameters.WritePOGNS_Comp(Line);
  Format_String(CONS_UART_Write, Line);
#ifdef WITH_AP
  Parameters.WritePOGNS_AP(Line);
  Format_String(CONS_UART_Write, Line);
#endif
#ifdef WITH_STRATUX
  Parameters.WritePOGNS_Stratux(Line);
  Format_String(CONS_UART_Write, Line);
#endif
  xSemaphoreGive(CONS_Mutex); }

